<a href="https://colab.research.google.com/github/anko191/Python_Kaggle/blob/master/pandas/pandas_nan.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [138]:
import pandas as pd
import numpy as np
import math
df = pd.read_csv('/content/sample_pandas_normal_nan.csv')
print(df)

      name   age state  point  other
0    Alice  24.0    NY    NaN    NaN
1      NaN   NaN   NaN    NaN    NaN
2  Charlie   NaN    CA    NaN    NaN
3     Dave  68.0    TX   70.0    NaN
4    Ellen   NaN    CA   88.0    NaN
5    Frank  30.0   NaN    NaN    NaN

In [139]:
pd.isnull(df.at[0,'point'])
np.isnan(df.at[0,'point'])
math.isnan(df.at[0,'point'])

True

In [140]:
print(df.at[0,'point'] == np.nan)

False

In [141]:
s_nan = pd.Series([None, np.nan, math.nan, pd.np.nan])
print(s_nan)
print(s_nan[0])

0   NaN
1   NaN
2   NaN
3   NaN
dtype: float64
nan

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:1: FutureWarning: The pandas.np module is deprecated and will be removed from pandas in a future version. Import numpy directly instead
  """Entry point for launching an IPython kernel.

In [142]:
print(s_nan.isnull())

0    True
1    True
2    True
3    True
dtype: bool

In [143]:
s_nan_str = pd.Series([None, pd.np.nan, 'NaN', 'nan'])
print(s_nan_str)
print(s_nan_str.isnull())

0    None
1     NaN
2     NaN
3     nan
dtype: object
0     True
1     True
2    False
3    False
dtype: bool

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:1: FutureWarning: The pandas.np module is deprecated and will be removed from pandas in a future version. Import numpy directly instead
  """Entry point for launching an IPython kernel.

In [144]:
s_nan_str_replace = s_nan_str.replace({'NaN':pd.np.nan, 'nan':pd.np.nan})
print(s_nan_str_replace)

0   NaN
1   NaN
2   NaN
3   NaN
dtype: float64

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:1: FutureWarning: The pandas.np module is deprecated and will be removed from pandas in a future version. Import numpy directly instead
  """Entry point for launching an IPython kernel.

In [146]:
print(s_nan_str_replace.isnull())

0    True
1    True
2    True
3    True
dtype: bool

In [147]:
print(df)

      name   age state  point  other
0    Alice  24.0    NY    NaN    NaN
1      NaN   NaN   NaN    NaN    NaN
2  Charlie   NaN    CA    NaN    NaN
3     Dave  68.0    TX   70.0    NaN
4    Ellen   NaN    CA   88.0    NaN
5    Frank  30.0   NaN    NaN    NaN

In [148]:
print(df.dropna(how = 'all'))

      name   age state  point  other
0    Alice  24.0    NY    NaN    NaN
2  Charlie   NaN    CA    NaN    NaN
3     Dave  68.0    TX   70.0    NaN
4    Ellen   NaN    CA   88.0    NaN
5    Frank  30.0   NaN    NaN    NaN

In [149]:
print(df.dropna(how='all', axis = 1))

      name   age state  point
0    Alice  24.0    NY    NaN
1      NaN   NaN   NaN    NaN
2  Charlie   NaN    CA    NaN
3     Dave  68.0    TX   70.0
4    Ellen   NaN    CA   88.0
5    Frank  30.0   NaN    NaN

In [152]:
print(df.dropna(how='all').dropna(how='all', axis = 1))

      name   age state  point
0    Alice  24.0    NY    NaN
2  Charlie   NaN    CA    NaN
3     Dave  68.0    TX   70.0
4    Ellen   NaN    CA   88.0
5    Frank  30.0   NaN    NaN

In [153]:
df2 = df.dropna(how='all').dropna(how = 'all', axis = 1)

In [154]:
df2

      name   age state  point
0    Alice  24.0    NY    NaN
2  Charlie   NaN    CA    NaN
3     Dave  68.0    TX   70.0
4    Ellen   NaN    CA   88.0
5    Frank  30.0   NaN    NaN

In [155]:
print(df2.dropna(how='any'))

   name   age state  point
3  Dave  68.0    TX   70.0

In [156]:
print(df2.dropna())

   name   age state  point
3  Dave  68.0    TX   70.0

In [157]:
print(df2.dropna(how = 'any', axis = 1))

      name
0    Alice
2  Charlie
3     Dave
4    Ellen
5    Frank

In [158]:
print(df.dropna(thresh=3))

    name   age state  point  other
0  Alice  24.0    NY    NaN    NaN
3   Dave  68.0    TX   70.0    NaN
4  Ellen   NaN    CA   88.0    NaN

In [159]:
print(df.dropna(thresh=3, axis = 1))

      name   age state
0    Alice  24.0    NY
1      NaN   NaN   NaN
2  Charlie   NaN    CA
3     Dave  68.0    TX
4    Ellen   NaN    CA
5    Frank  30.0   NaN

In [160]:
print(df.dropna(subset=['age']))

    name   age state  point  other
0  Alice  24.0    NY    NaN    NaN
3   Dave  68.0    TX   70.0    NaN
5  Frank  30.0   NaN    NaN    NaN

In [161]:
print(df.dropna(subset=['age', 'state']))

    name   age state  point  other
0  Alice  24.0    NY    NaN    NaN
3   Dave  68.0    TX   70.0    NaN

In [162]:
print(df.dropna(subset=['age', 'state'], how = 'all'))

      name   age state  point  other
0    Alice  24.0    NY    NaN    NaN
2  Charlie   NaN    CA    NaN    NaN
3     Dave  68.0    TX   70.0    NaN
4    Ellen   NaN    CA   88.0    NaN
5    Frank  30.0   NaN    NaN    NaN

In [164]:
print(df.dropna(subset=[0,4],axis= 1))
print(df.dropna(subset=[0,4],axis=1, how='all'))

      name state
0    Alice    NY
1      NaN   NaN
2  Charlie    CA
3     Dave    TX
4    Ellen    CA
5    Frank   NaN
      name   age state  point
0    Alice  24.0    NY    NaN
1      NaN   NaN   NaN    NaN
2  Charlie   NaN    CA    NaN
3     Dave  68.0    TX   70.0
4    Ellen   NaN    CA   88.0
5    Frank  30.0   NaN    NaN

In [165]:
print(df.fillna(0))

      name   age state  point  other
0    Alice  24.0    NY    0.0    0.0
1        0   0.0     0    0.0    0.0
2  Charlie   0.0    CA    0.0    0.0
3     Dave  68.0    TX   70.0    0.0
4    Ellen   0.0    CA   88.0    0.0
5    Frank  30.0     0    0.0    0.0

In [166]:
print(df.fillna({'name':'XXX', 'age':20, 'point':20}))

      name   age state  point  other
0    Alice  24.0    NY   20.0    NaN
1      XXX  20.0   NaN   20.0    NaN
2  Charlie  20.0    CA   20.0    NaN
3     Dave  68.0    TX   70.0    NaN
4    Ellen  20.0    CA   88.0    NaN
5    Frank  30.0   NaN   20.0    NaN

In [167]:
s_for_fill = pd.Series(['ZZZ', 100], index = ['name', 'age'])
print(s_for_fill)
print(df.fillna(s_for_fill))

name    ZZZ
age     100
dtype: object
      name    age state  point  other
0    Alice   24.0    NY    NaN    NaN
1      ZZZ  100.0   NaN    NaN    NaN
2  Charlie  100.0    CA    NaN    NaN
3     Dave   68.0    TX   70.0    NaN
4    Ellen  100.0    CA   88.0    NaN
5    Frank   30.0   NaN    NaN    NaN

In [168]:
print(df.mean())

age      40.666667
point    79.000000
other          NaN
dtype: float64

In [169]:
print(df.fillna(df.mean()))

      name        age state  point  other
0    Alice  24.000000    NY   79.0    NaN
1      NaN  40.666667   NaN   79.0    NaN
2  Charlie  40.666667    CA   79.0    NaN
3     Dave  68.000000    TX   70.0    NaN
4    Ellen  40.666667    CA   88.0    NaN
5    Frank  30.000000   NaN   79.0    NaN

In [171]:
print(df.fillna(df.mode().iloc[0])) ## df.mode() return DataFrame

      name   age state  point  other
0    Alice  24.0    NY   70.0    NaN
1    Alice  24.0    CA   70.0    NaN
2  Charlie  24.0    CA   70.0    NaN
3     Dave  68.0    TX   70.0    NaN
4    Ellen  24.0    CA   88.0    NaN
5    Frank  30.0    CA   70.0    NaN

In [172]:
print(df.fillna(method = 'ffill'))

      name   age state  point  other
0    Alice  24.0    NY    NaN    NaN
1    Alice  24.0    NY    NaN    NaN
2  Charlie  24.0    CA    NaN    NaN
3     Dave  68.0    TX   70.0    NaN
4    Ellen  68.0    CA   88.0    NaN
5    Frank  30.0    CA   88.0    NaN

In [173]:
print(df.fillna(method = 'bfill'))

      name   age state  point  other
0    Alice  24.0    NY   70.0    NaN
1  Charlie  68.0    CA   70.0    NaN
2  Charlie  68.0    CA   70.0    NaN
3     Dave  68.0    TX   70.0    NaN
4    Ellen  30.0    CA   88.0    NaN
5    Frank  30.0   NaN    NaN    NaN

In [174]:
print(df.fillna(method = 'bfill', limit = 1).fillna(method='ffill', limit = 1))

      name   age state  point  other
0    Alice  24.0    NY    NaN    NaN
1  Charlie  24.0    CA    NaN    NaN
2  Charlie  68.0    CA   70.0    NaN
3     Dave  68.0    TX   70.0    NaN
4    Ellen  30.0    CA   88.0    NaN
5    Frank  30.0    CA   88.0    NaN

In [175]:
s = df['age']
print(s)

0    24.0
1     NaN
2     NaN
3    68.0
4     NaN
5    30.0
Name: age, dtype: float64

In [176]:
print(s.fillna(100))

0     24.0
1    100.0
2    100.0
3     68.0
4    100.0
5     30.0
Name: age, dtype: float64

In [177]:
print(s.fillna({1:100,4:0}))

0     24.0
1    100.0
2      NaN
3     68.0
4      0.0
5     30.0
Name: age, dtype: float64

In [178]:
print(s.fillna(method='bfill',limit = 1))

0    24.0
1     NaN
2    68.0
3    68.0
4    30.0
5    30.0
Name: age, dtype: float64

In [179]:
print(df)
print(df['point'].isnull())
print(df[df['point'].isnull()])

      name   age state  point  other
0    Alice  24.0    NY    NaN    NaN
1      NaN   NaN   NaN    NaN    NaN
2  Charlie   NaN    CA    NaN    NaN
3     Dave  68.0    TX   70.0    NaN
4    Ellen   NaN    CA   88.0    NaN
5    Frank  30.0   NaN    NaN    NaN
0     True
1     True
2     True
3    False
4    False
5     True
Name: point, dtype: bool
      name   age state  point  other
0    Alice  24.0    NY    NaN    NaN
1      NaN   NaN   NaN    NaN    NaN
2  Charlie   NaN    CA    NaN    NaN
5    Frank  30.0   NaN    NaN    NaN

In [180]:
print(df.iloc[2].isnull())

name     False
age       True
state    False
point     True
other     True
Name: 2, dtype: bool

In [181]:
print(df.loc[:, df.iloc[2].isnull()])

    age  point  other
0  24.0    NaN    NaN
1   NaN    NaN    NaN
2   NaN    NaN    NaN
3  68.0   70.0    NaN
4   NaN   88.0    NaN
5  30.0    NaN    NaN

In [182]:
print(df2.isnull().any(axis = 1))
print(df2[df2.isnull().any(axis = 1)])

0     True
2     True
3    False
4     True
5     True
dtype: bool
      name   age state  point
0    Alice  24.0    NY    NaN
2  Charlie   NaN    CA    NaN
4    Ellen   NaN    CA   88.0
5    Frank  30.0   NaN    NaN

In [183]:
print(df2.isnull().any())
print(df2.loc[:, df2.isnull().any()])

name     False
age       True
state     True
point     True
dtype: bool
    age state  point
0  24.0    NY    NaN
2   NaN    CA    NaN
3  68.0    TX   70.0
4   NaN    CA   88.0
5  30.0   NaN    NaN

In [184]:
import pandas as pd
df = pd.read_csv('/content/sample_pandas_normal_nan.csv')
print(df)

      name   age state  point  other
0    Alice  24.0    NY    NaN    NaN
1      NaN   NaN   NaN    NaN    NaN
2  Charlie   NaN    CA    NaN    NaN
3     Dave  68.0    TX   70.0    NaN
4    Ellen   NaN    CA   88.0    NaN
5    Frank  30.0   NaN    NaN    NaN

In [185]:
print(df.isnull())

    name    age  state  point  other
0  False  False  False   True   True
1   True   True   True   True   True
2  False   True  False   True   True
3  False  False  False  False   True
4  False   True  False  False   True
5  False  False   True   True   True

In [186]:
print(df.isnull().all())

name     False
age      False
state    False
point    False
other     True
dtype: bool

In [187]:
print(df.isnull().all(axis = 1))

0    False
1     True
2    False
3    False
4    False
5    False
dtype: bool

In [188]:
print(df.isnull().any())

name     True
age      True
state    True
point    True
other    True
dtype: bool

In [189]:
print(df.isnull().any(axis = 1))

0    True
1    True
2    True
3    True
4    True
5    True
dtype: bool

In [191]:
print(df.isnull().sum())

name     1
age      3
state    2
point    4
other    6
dtype: int64

In [192]:
print(df.isnull().sum(axis = 1))

0    2
1    5
2    3
3    1
4    2
5    3
dtype: int64

In [193]:
df

      name   age state  point  other
0    Alice  24.0    NY    NaN    NaN
1      NaN   NaN   NaN    NaN    NaN
2  Charlie   NaN    CA    NaN    NaN
3     Dave  68.0    TX   70.0    NaN
4    Ellen   NaN    CA   88.0    NaN
5    Frank  30.0   NaN    NaN    NaN

In [194]:
print(df.count())

name     5
age      3
state    4
point    2
other    0
dtype: int64

In [195]:
print(df.count(axis = 1))

0    3
1    0
2    2
3    4
4    3
5    2
dtype: int64

In [196]:
print(df.isnull().values)

[[False False False  True  True]
 [ True  True  True  True  True]
 [False  True False  True  True]
 [False False False False  True]
 [False  True False False  True]
 [False False  True  True  True]]

In [197]:
print(df.isnull().values.sum())

16

In [198]:
print(df.count().sum())

14

In [199]:
print(df.isnull().values.sum() != 0)

True

In [200]:
print(df.size)

30

In [201]:
print(df.isnull().values.sum() == df.size)

False

In [202]:
s = df['state']
print(s)

0     NY
1    NaN
2     CA
3     TX
4     CA
5    NaN
Name: state, dtype: object

In [203]:
print(s.isnull())

0    False
1     True
2    False
3    False
4    False
5     True
Name: state, dtype: bool

In [204]:
print(s.isnull().any())

True

In [205]:
print(s.isnull().sum())

2

In [206]:
print(s.count())

4

In [207]:

import pandas as pd
df = pd.DataFrame({'col1':[0,pd.np.nan, pd.np.nan, 3,4],
                   'col2':[pd.np.nan, 1, 2, pd.np.nan, pd.np.nan],
                   'col3':[4,pd.np.nan, pd.np.nan, 7, 10]})
df

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:2: FutureWarning: The pandas.np module is deprecated and will be removed from pandas in a future version. Import numpy directly instead

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:3: FutureWarning: The pandas.np module is deprecated and will be removed from pandas in a future version. Import numpy directly instead
  This is separate from the ipykernel package so we can avoid doing imports until
/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:4: FutureWarning: The pandas.np module is deprecated and will be removed from pandas in a future version. Import numpy directly instead
  after removing the cwd from sys.path.

   col1  col2  col3
0   0.0   NaN   4.0
1   NaN   1.0   NaN
2   NaN   2.0   NaN
3   3.0   NaN   7.0
4   4.0   NaN  10.0

In [208]:
print(df.interpolate())

   col1  col2  col3
0   0.0   NaN   4.0
1   1.0   1.0   5.0
2   2.0   2.0   6.0
3   3.0   2.0   7.0
4   4.0   2.0  10.0

In [209]:
print(df.interpolate(axis = 1))

   col1  col2  col3
0   0.0   2.0   4.0
1   NaN   1.0   1.0
2   NaN   2.0   2.0
3   3.0   5.0   7.0
4   4.0   7.0  10.0

In [210]:
print(df.interpolate(limit=1))

   col1  col2  col3
0   0.0   NaN   4.0
1   1.0   1.0   5.0
2   NaN   2.0   NaN
3   3.0   2.0   7.0
4   4.0   NaN  10.0

In [211]:
print(df.interpolate(limit=1,limit_direction='forward'))

   col1  col2  col3
0   0.0   NaN   4.0
1   1.0   1.0   5.0
2   NaN   2.0   NaN
3   3.0   2.0   7.0
4   4.0   NaN  10.0

In [212]:
print(df.interpolate(limit=1,limit_direction='backward'))

   col1  col2  col3
0   0.0   1.0   4.0
1   NaN   1.0   NaN
2   2.0   2.0   6.0
3   3.0   NaN   7.0
4   4.0   NaN  10.0

In [213]:
print(df.interpolate(limit=1,limit_direction='both'))

   col1  col2  col3
0   0.0   1.0   4.0
1   1.0   1.0   5.0
2   2.0   2.0   6.0
3   3.0   2.0   7.0
4   4.0   NaN  10.0

In [214]:
print(df.interpolate(limit_direction='both'))

   col1  col2  col3
0   0.0   1.0   4.0
1   1.0   1.0   5.0
2   2.0   2.0   6.0
3   3.0   2.0   7.0
4   4.0   2.0  10.0

In [216]:
print(df.interpolate(limit_area='outside'))
print(df.interpolate(limit_area='outside',limit_direction='both'))

   col1  col2  col3
0   0.0   NaN   4.0
1   NaN   1.0   NaN
2   NaN   2.0   NaN
3   3.0   2.0   7.0
4   4.0   2.0  10.0
   col1  col2  col3
0   0.0   1.0   4.0
1   NaN   1.0   NaN
2   NaN   2.0   NaN
3   3.0   2.0   7.0
4   4.0   2.0  10.0

In [217]:
df_copy = df.copy()

In [218]:
df_copy.interpolate(inplace=True)
print(df_copy)

   col1  col2  col3
0   0.0   NaN   4.0
1   1.0   1.0   5.0
2   2.0   2.0   6.0
3   3.0   2.0   7.0
4   4.0   2.0  10.0

In [219]:
s = pd.Series([0, pd.np.nan, pd.np.nan, pd.np.nan, 4, pd.np.nan, pd.np.nan],
              index=[0, 2, 5, 6, 8, 10, 14])
print(s)

0     0.0
2     NaN
5     NaN
6     NaN
8     4.0
10    NaN
14    NaN
dtype: float64

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:1: FutureWarning: The pandas.np module is deprecated and will be removed from pandas in a future version. Import numpy directly instead
  """Entry point for launching an IPython kernel.

In [220]:
print(s.interpolate())

0     0.0
2     1.0
5     2.0
6     3.0
8     4.0
10    4.0
14    4.0
dtype: float64

In [221]:
print(s.interpolate('index'))

0     0.0
2     1.0
5     2.5
6     3.0
8     4.0
10    4.0
14    4.0
dtype: float64

In [222]:
print(s.interpolate('values'))

0     0.0
2     1.0
5     2.5
6     3.0
8     4.0
10    4.0
14    4.0
dtype: float64

In [223]:
s = pd.Series([0, 10, pd.np.nan, pd.np.nan, 4, pd.np.nan, pd.np.nan],
              index=[0, 2, 5, 6, 8, 10, 14])

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:1: FutureWarning: The pandas.np module is deprecated and will be removed from pandas in a future version. Import numpy directly instead
  """Entry point for launching an IPython kernel.

In [224]:
print(s.interpolate('spline',order=2))

0      0.00
2     10.00
5     13.75
6     12.00
8      4.00
10   -10.00
14   -56.00
dtype: float64

In [225]:
s.index = range(7)
print(s.interpolate('spline',order=2))

0     0.0
1    10.0
2    14.0
3    12.0
4     4.0
5   -10.0
6   -30.0
dtype: float64

In [226]:
df_nan = pd.DataFrame({'value': [1, pd.np.nan, pd.np.nan, pd.np.nan, 31]},
                      index=pd.to_datetime(['2018-01-01', '2018-01-02', '2018-01-15', '2018-01-20', '2018-01-31']))

print(df_nan)

            value
2018-01-01    1.0
2018-01-02    NaN
2018-01-15    NaN
2018-01-20    NaN
2018-01-31   31.0

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:1: FutureWarning: The pandas.np module is deprecated and will be removed from pandas in a future version. Import numpy directly instead
  """Entry point for launching an IPython kernel.

In [227]:
print(df_nan.interpolate())

            value
2018-01-01    1.0
2018-01-02    8.5
2018-01-15   16.0
2018-01-20   23.5
2018-01-31   31.0

In [228]:
print(df_nan.interpolate('time'))

            value
2018-01-01    1.0
2018-01-02    2.0
2018-01-15   15.0
2018-01-20   20.0
2018-01-31   31.0